app/controllers/alumno_controller.rb

  def index
  	@currentUser = current_user.tipouser
  	@currentUsercurso = current_user.curso_id
  	@Asignaturas = Asignatura.all.where :curso_id => current_user.curso_id
---
SELECT "asignaturas".* FROM "asignaturas" WHERE "asignaturas"."curso_id" = $1  [["curso_id", 1]]