app/controllers/alumno_controller.rb

SELECT "asignaturas".* FROM "asignaturas"
---
  def index
  	@currentUser = current_user.tipouser
  	@currentUsercurso = current_user.curso_id
  	@Asignaturas = Asignatura.all