app/controllers/evaluacions_controller.rb

  def index
    @evaluacions = Evaluacion.all
---
SELECT "evaluacions".* FROM "evaluacions"

  def create
    @evaluacion = Evaluacion.new(evaluacion_params)

    respond_to do |format|
      if @evaluacion.save
---
INSERT INTO "evaluacions" ("nota", "comentario", "user_id", "created_at", "updated_at", "user_creation") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nota", 5], ["comentario", "prueba7"], ["user_id", 1], ["created_at", "2019-10-11 03:40:44.783684"], ["updated_at", "2019-10-11 03:40:44.783684"], ["user_creation", 4]]

  def destroy
    @evaluacion.destroy
---
DELETE FROM "evaluacions" WHERE "evaluacions"."id" = $1  [["id", 1]]

    def set_evaluacion
      @evaluacion = Evaluacion.find(params[:id])
---
SELECT "evaluacions".* FROM "evaluacions" WHERE "evaluacions"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]