app/controllers/home_controller.rb

  def curso
  	@asignaturascurso = Asignatura.all.where :curso_id => current_user.curso_id
  	@posts = Post.all.where :asignatura_id => @asignaturascurso.ids
---
SELECT "asignaturas"."id" FROM "asignaturas" WHERE "asignaturas"."curso_id" = $1  [["curso_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."asignatura_id" = $1  [["asignatura_id", 1]]