app/controllers/home_controller.rb

  def index
  	#entrega todos los usuarios ordenados por id  descendente
  	@users = User.all.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]