app/controllers/profesors_controller.rb

SELECT "asignaturas".* FROM "asignaturas"
---
  def index
  	@currentUser = current_user.tipouser
  	@currentUserid = User.find(params[:id])
  	@asignaturas = Asignatura.all