app/controllers/profesor_controller.rb

SELECT "asignaturas".* FROM "asignaturas"
---
  def index
  	@currentUser = current_user.tipouser
  	@currentUserid = current_user.id
  	@asignaturas = Asignatura.all