app/controllers/profesors_controller.rb

  def index
  	@currentUser = current_user.tipouser
  	@iduser =params[:id]
  	@evaluaciones = Evaluacion.all.where :user_id =>current_user.id
    @iduser2= current_user.id
  	@currentUserid = User.find(params[:id])
  	@asignaturas = Asignatura.all.where :user_id => @currentUserid
  	@promedioevaluaciones = Evaluacion.average(:nota)
  	if(Evaluacion.exists?(user_id: params[:id], user_creation: current_user.id))
---
SELECT "evaluacions".* FROM "evaluacions" WHERE "evaluacions"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "asignaturas".* FROM "asignaturas" WHERE "asignaturas"."user_id" = $1  [["user_id", 1]]
SELECT AVG("evaluacions"."nota") FROM "evaluacions"
SELECT 1 AS one FROM "evaluacions" WHERE "evaluacions"."user_id" = $1 AND "evaluacions"."user_creation" = $2 LIMIT $3  [["user_id", 1], ["user_creation", 4], ["LIMIT", 1]]

  def todos
  	@profesores=User.all.where(:tipouser => 2)
---
SELECT "users".* FROM "users" WHERE "users"."tipouser" = $1  [["tipouser", 2]]